// JavaScript source code
window.onscroll = function () { myFunction() };

var navbar = document.getElementById("navbar");
var sticky = navbar.offsetTop;

function myFunction() {
    if (window.pageYOffset >= sticky) {
        navbar.classList.add("sticky")
    } else {
        navbar.classList.remove("sticky");
    }
}
function changeOption() {
    document.getElementById('lang').value = 'css';

}
function calculateFare(event) {
        event.preventDefault();

        var origin = document.getElementById("origin").value;
        var destination = document.getElementById("destination").value;    
        var sfare;
        var fare;
        var fareTable;
   
    switch (origin + "-" + destination) {

         // สายอัสสัมชัญ
         // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-ตลาดหมอสาโรจน์ (อัสสัมชัญ)":
            fare = 12; sfare = 10; 
            break;
        case "บขส.เก่าระยอง-แหลมทองระยอง (อัสสัมชัญ)":
            fare = 12; sfare = 10;
            break;
        case "บขส.เก่าระยอง-นครชัยแอร์ (อัสสัมชัญ)":
            fare = 12; sfare = 10; 
            break;
        case "บขส.เก่าระยอง-โฮมโปร (อัสสัมชัญ)":
            fare = 12; sfare = 10; 
            break;
        case "บขส.เก่าระยอง-แยกพีเอ็มวาย (อัสสัมชัญ)":
            fare = 12; sfare = 10; 
            break;
        case "บขส.เก่าระยอง-สนามกีฬากลางจังหวัดระยอง (อัสสัมชัญ)":
            fare = 12; sfare = 10;
            break;
        case "บขส.เก่าระยอง-โรงเรียนเซนโยเซฟระยอง (อัสสัมชัญ)":
            fare = 12; sfare = 10;
            break;
        case "บขส.เก่าระยอง-โรงเรียนอัสสัมชัญระยอง (อัสสัมชัญ)":
            fare = 12; sfare = 10; 
            break;

        // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-อบจ.ระยอง (อัสสัมชัญ)":
            fare = 15; sfare = 12;
            break;
        case "บขส.เก่าระยอง-สำนักงานประกันสังคม (อัสสัมชัญ)":
            fare = 15; sfare = 12;
            break;
        case "บขส.เก่าระยอง-เพลินใจ 2 (อัสสัมชัญ)":
            fare = 15; sfare = 12;
            break;
        case "บขส.เก่าระยอง-การไฟฟ้า (อัสสัมชัญ)":
            fare = 15; sfare = 12;
            break;
        case "บขส.เก่าระยอง-สำนักงานอัยการจังหวัดระยอง (อัสสัมชัญ)":
            fare = 15; sfare = 12;
            break;


        // สายมาบตาพุด
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-แหลมทองระยอง (มาบตาพุด)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-นครชัยแอร์ (มาบตาพุด)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-โฮมโปร (มาบตาพุด)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-แยกพีเอ็มวาย (มาบตาพุด)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-สนามกีฬากลางจังหวัดระยอง (มาบตาพุด)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-โรงเรียนเซนโยเซฟระยอง (มาบตาพุด)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-โรงเรียนอัสสัมชัญระยอง (มาบตาพุด)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-อบจ.ระยอง (มาบตาพุด)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-สำนักงานอัยการจังหวัดระยอง (มาบตาพุด)":
            fare = 15; sfare = 10;
            break;

        // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-วงเวียนสามแยกขนส่งระยอง (มาบตาพุด)":
            fare = 20; sfare = 15;
            break;
        case "บขส.เก่าระยอง-ทางลอดแยกเนินสำลี (มาบตาพุด)":
            fare = 20; sfare = 15;
            break;
        case "บขส.เก่าระยอง-ศาลากลางจังหวัดระยอง (มาบตาพุด)":
            fare = 20; sfare = 15;
            break;
        case "บขส.เก่าระยอง-สะพานลอยมาบตาพุด (มาบตาพุด)":
            fare = 20; sfare = 15;
            break;


        // สายบ้านฉาง
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-แหลมทองระยอง (บ้านฉาง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-แยกพีเอ็มวาย (บ้านฉาง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-สนามกีฬากลางจังหวัดระยอง (บ้านฉาง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-อบจ.ระยอง (บ้านฉาง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-สำนักงานอัยการจังหวัดระยอง (บ้านฉาง)":
            fare = 15; sfare = 10;
            break;

        // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-วงเวียนสามแยกขนส่งระยอง (บ้านฉาง)":
            fare = 20; sfare = 15;
            break;
        case "บขส.เก่าระยอง-ทางลอดแยกเนินสำลี (บ้านฉาง)":
            fare = 20; sfare = 15;
            break;
        case "บขส.เก่าระยอง-ตลาดนัดเมืองใหม่มาบตาพุด (บ้านฉาง)":
            fare = 20; sfare = 15;
            break;

        case "บขส.เก่าระยอง-โรงแยกก๊าซธรรมชาติระยอง (บ้านฉาง)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-วิทยาลัยเทคนิคนิคมอุตสาหกรรมระยอง (บ้านฉาง)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-วัดเนินกระปรอก (บ้านฉาง)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-โลตัสบ้านฉาง (บ้านฉาง)":
            fare = 25; sfare = 20;
            break;


        // สายนิคมพัฒนา
        // ต้นทางบขส.เก่าระยอง
        case "บขส.เก่าระยอง-โรงพยาบาลจุฬารัตน์ระยอง (นิคมพัฒนา)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-เซ็นทรัลระยอง (นิคมพัฒนา)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-ตลาดน้ำเกาะกลอย (นิคมพัฒนา)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-แม็คโครระยอง (นิคมพัฒนา)":
            fare = 15; sfare = 10;
            break;

        case "บขส.เก่าระยอง-แยกทับมา (นิคมพัฒนา)":
            fare = 20; sfare = 15;
            break;

        case "บขส.เก่าระยอง-สี่แยกมาบข่า (นิคมพัฒนา)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-องค์การบรหารส่วนตำบลนิคมพัฒนา (นิคมพัฒนา)":
            fare = 25; sfare = 20;
            break;

        case "บขส.เก่าระยอง-ตลาดนัดนิคมซอย 13 (นิคมพัฒนา)":
            fare = 35; sfare = 25;
            break;

        case "บขส.เก่าระยอง-นิคมซอย 13 (นิคมพัฒนา)":
            fare = 40; sfare = 30;
            break;


        // สายหาดแม่รำพึง
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-โรงพยาบาลระยอง (หาดแม่รำพึง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-สองพี่น้อง (หาดแม่รำพึง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-เคมี อ.อุ๊ (หาดแม่รำพึง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-ตลาดหนองจอก (หาดแม่รำพึง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-วิทยาลัย IRPC (หาดแม่รำพึง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-พัน ร.7 (หาดแม่รำพึง)":
            fare = 15; sfare = 10;
            break;

        // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-ตลาดตะพง (หาดแม่รำพึง)":
            fare = 20; sfare = 15;
            break;

        case "บขส.เก่าระยอง-โรงแรมระยองบีช (หาดแม่รำพึง)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-ลานหินขาว (หาดแม่รำพึง)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-หาดแม่รำพึง (หาดแม่รำพึง)":
            fare = 25; sfare = 20;
            break;


        // สายบ้านค่าย
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-เกาะกลอย (บ้านค่าย)":
            fare = 15; sfare = 12;
            break;
        case "บขส.เก่าระยอง-น้ำคอก (บ้านค่าย)":
            fare = 15; sfare = 12;
            break;

        // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-ศุภาลัย (บ้านค่าย)":
            fare = 20; sfare = 15;
            break;
        case "บขส.เก่าระยอง-บ้านเก่า (บ้านค่าย)":
            fare = 20; sfare = 15;
            break;
        case "บขส.เก่าระยอง-โรงเรียนนานาชาติสิงคโปร์ (บ้านค่าย)":
            fare = 20; sfare = 15;
            break;
        case "บขส.เก่าระยอง-ศาลามังคุด (บ้านค่าย)":
            fare = 25; sfare = 18;
            break;
        case "บขส.เก่าระยอง-โรงเรียนบ้านค่าย (บ้านค่าย)":
            fare = 25; sfare = 18;
            break;
        case "บขส.เก่าระยอง-โรงพยาบาลบ้านค่าย (บ้านค่าย)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-ตลาดไผ่ล้อม (บ้านค่าย)":
            fare = 25; sfare = 20;
            break;


        // สายเจ็ดลูกเนิน
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-โรงพยาบาลจุฬารัตน์ระยอง (เจ็ดลูกเนิน)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-แยกเกาะกลอย (เจ็ดลูกเนิน)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-ครัวแกงเผ็ด (เจ็ดลูกเนิน)":
            fare = 15; sfare = 10;
            break;

        case "บขส.เก่าระยอง-โรงพยาบาลศรีระยอง (เจ็ดลูกเนิน)":
            fare = 20; sfare = 15;
            break;
        case "บขส.เก่าระยอง-เทศบาลตำบลเชิงเนิน (เจ็ดลูกเนิน)":
            fare = 20; sfare = 15;
            break;
        case "บขส.เก่าระยอง-สี่แยกบ้านดอน (เจ็ดลูกเนิน)":
            fare = 20; sfare = 15;
            break;

        // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-สี่แยกวัดตาขัน (เจ็ดลูกเนิน)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-รพ.สต.บ้านหนองตะแบก (เจ็ดลูกเนิน)":
            fare = 25; sfare = 20;
            break;

        case "บขส.เก่าระยอง-สี่แยกชากกอไผ่ (เจ็ดลูกเนิน)":
            fare = 30; sfare = 25;
            break;
        case "บขส.เก่าระยอง-วัดห้วงหิน (เจ็ดลูกเนิน)":
            fare = 30; sfare = 25;
            break;
        case "บขส.เก่าระยอง-วัดเจ็ดลูกเนิน (เจ็ดลูกเนิน)":
            fare = 30; sfare = 25;
            break;
        case "บขส.เก่าระยอง-ที่พักสายตรวจบ้านเจ็ดลูกเนิน (เจ็ดลูกเนิน)":
            fare = 30; sfare = 25;
            break;


        // สายหนองผักหนาม
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-โรงพยาบาลจุฬารัตน์ระยอง (หนองผักหนาม)":
            fare = 15; sfare = 12;
            break;
        case "บขส.เก่าระยอง-ถนนชายกระป่อม (หนองผักหนาม)":
            fare = 15; sfare = 12;
            break;
        case "บขส.เก่าระยอง-เซ็นทรัลระยอง (หนองผักหนาม)":
            fare = 15; sfare = 12;
            break;
        case "บขส.เก่าระยอง-แม็คโครระยอง (หนองผักหนาม)":
            fare = 15; sfare = 12;
            break;
            
        // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-สี่แยกทับมา (หนองผักหนาม)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-วัดเขาโบสถ์ (หนองผักหนาม)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-วัดกระเฉท (หนองผักหนาม)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-รพ.สต.บ้านกระเฉท (หนองผักหนาม)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-วัดหนองผักหนาม (หนองผักหนาม)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-วัดมาบข่า (หนองผักหนาม)":
            fare = 25; sfare = 20;
            break;


        // สายปากน้ำ
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-โรงพยาบาลระยอง (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-หอนาฬิกา (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-วัดลุ่ม (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-สถานีตำรวจภูธรระยอง (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-เทศบาลนครระยอง (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-ที่ว่าการอำเภอเมืองระยอง (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-โรงเรียนระยองวิทยาคม (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-วิทลัยเทคนิคระยอง (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-ถนนสัมฤทธิ์ (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-โรงเรียนระยองวิทย์ปากน้ำ (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-วัดปากน้ำสมุทรคงคราม (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-ถนนเลียบชายฝั่ง (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-หาดแหลมเจริญ (ปากน้ำ)":
            fare = 15; sfare = 10;
            break;


        // สายบ้านเพ
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-โรงพยาบาลระยอง (บ้านเพ)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-IRPC (บ้านเพ)":
            fare = 30; sfare = 25;
            break;
        case "บขส.เก่าระยอง-ตลาดผลไม้ตะพง (บ้านเพ)":
            fare = 30; sfare = 25;
            break;
        case "บขส.เก่าระยอง-ตำนานป่า (บ้านเพ)":
            fare = 30; sfare = 25;
            break;
        case "บขส.เก่าระยอง-สวนพฤษชาติโสภณ (บ้านเพ)":
            fare = 30; sfare = 25;
            break;
        case "บขส.เก่าระยอง-ตลาดร้อยเสา (บ้านเพ)":
            fare = 30; sfare = 25;
            break;
        case "บขส.เก่าระยอง-ตลาดสดบ้านเพ (บ้านเพ)":
            fare = 30; sfare = 25;
            break;
        case "บขส.เก่าระยอง-ท่าเรือเพ (บ้านเพ)":
            fare = 30; sfare = 25;
            break;
        case "บขส.เก่าระยอง-โลตัสบ้านเพ (บ้านเพ)":
            fare = 30; sfare = 25;
            break;


        // สายสามย่าน
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-วิทยาลัยอาชีวศึกษาโปลีเทคนิคระยอง (สามย่าน)":
            fare = 50; sfare = 30;
            break;
        case "บขส.เก่าระยอง-ตลาดผลไม้ตะพง (สามย่าน)":
            fare = 50; sfare = 30;
            break;
        case "บขส.เก่าระยอง-วัดเขาสำเภาทอง (สามย่าน)":
            fare = 50; sfare = 30;
            break;

            // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-แยกกะเฉด (สามย่าน)":
            fare = 50; sfare = 40;
            break;
        case "บขส.เก่าระยอง-โรงเรียนบ้านสองสลึง (สามย่าน)":
            fare = 50; sfare = 40;
            break;
        case "บขส.เก่าระยอง-โรงพยาบาลสามย่าน (สามย่าน)":
            fare = 50; sfare = 40;
            break;
        case "บขส.เก่าระยอง-คิวรถสองแถวสามย่าน (สามย่าน)":
            fare = 50; sfare = 40;
            break;


        // สายวังจันทร์
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-แยกเกาะกลอย (วังจันทร์)":
            fare = 20; fare = 15;
            break;
        case "บขส.เก่าระยอง-วัดบ้านเก่า (วังจันทร์)":
            fare = 20; sfare = 15;
            break;

        case "บขส.เก่าระยอง-วัดบ้านค่าย (วังจันทร์)":
            fare = 30; sfare = 20;
            break;

        // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-สี่แยกบางบุตร (วังจันทร์)":
            fare = 35; sfare = 25;
            break;

        case "บขส.เก่าระยอง-แยกสนากีฬาบางบุตร (วังจันทร์)":
            fare = 40; sfare = 30;
            break;
        case "บขส.เก่าระยอง-บ้านห้วยยาง (วังจันทร์)":
            fare = 45; sfare = 35;
            break;
        case "บขส.เก่าระยอง-วัดเนินสว่าง (วังจันทร์)":
            fare = 50; sfare = 40;
            break;
        case "บขส.เก่าระยอง-วัดเขาตาอิ๋น (วังจันทร์)":
            fare = 50; sfare = 40;
            break;
        case "บขส.เก่าระยอง-ตลาดชุมแสง (วังจันทร์)":
            fare = 50; sfare = 40;
            break;


        // สายบ้านแลง
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-แยกบ้านแลง (บ้านแลง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-เฮาส์ซิ่ง IRPC (บ้านแลง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-ชากใหญ่ (บ้านแลง)":
            fare = 15; sfare = 10;
            break;
        case "บขส.เก่าระยอง-วัดจุฬามุนี (บ้านแลง)":
            fare = 15; sfare = 10;
            break;

        // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-บ้านแลง (บ้านแลง)":
            fare = 17; sfare = 12;
            break;
        case "บขส.เก่าระยอง-ขวากลิง (บ้านแลง)":
            fare = 20; sfare = 16;
            break;
        case "บขส.เก่าระยอง-วัดเขาพระบาท (บ้านแลง)":
            fare = 25; sfare = 20;
            break;
        

        // สายบ้านตาสิทธ์
        // ต้นทางบขส.เก่าระยอง ระยะใกล้
        case "บขส.เก่าระยอง-วัดบ้านค่าย (บ้านตาสิทธิ์)":
            fare = 25; sfare = 20;
            break;
        case "บขส.เก่าระยอง-สี่แยกบางบุตร (บ้านตาสิทธิ์)":
            fare = 40; sfare = 25;
            break;
        case "บขส.เก่าระยอง-องค์การบริหารส่วนตำบลหนองบัว (บ้านตาสิทธิ์)":
            fare = 40; sfare = 25;
            break;
        case "บขส.เก่าระยอง-วัดหนองกรับ (บ้านตาสิทธิ์)":
            fare = 40; sfare = 25;
            break;

        // ต้นทางบขส.เก่าระยอง ระยะไกล
        case "บขส.เก่าระยอง-ปากแพรก (บ้านตาสิทธิ์)":
            fare = 50; sfare = 30;
            break;
        case "บขส.เก่าระยอง-สวนผึ้งปลวกแดง (บ้านตาสิทธิ์)":
            fare = 50; sfare = 30;
            break;
        case "บขส.เก่าระยอง-แยกเขาน้อย (บ้านตาสิทธิ์)":
            fare = 60; sfare = 40;
            break;


        default:
            alert("สถานีต้นทาง - ปลายทางไม่ถูกต้อง กรุณาเลือกใหม่");
            return;
    }
    window.location.href = "ผลลัพธ์การคำนวณ.html?origin=" + origin + "&destination=" + destination + "&fare=" + fare + "&sfare=" + sfare;

    var fareTable = "<table><tr><th>เด็ก</th><th>นักเรียน - นักศึกษา</th><th>บุคคลทั่วไป</th><th>ผู้ใหญ่</th></tr>";
    fareTable += "<tr><td>" + sfare + "</td><td>" + sfare + "</td><td>" + fare + "<td>" + fare + "</td></td></tr>";
    fareTable += "</table>";
}